uhnp/src/Catalogs/ВидыОбъектовФинансовогоХарактера/ВидыОбъектовФинансовогоХарактера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовФинансовогоХарактера</name>
  <predefined>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>ДебиторскаяЗадолженность</name>
      <description>Дебиторская задолженность</description>
    </items>
    <items>
      <name>ДепозитВыданный</name>
      <description>Депозит выданный</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>ЛизингВыданный</name>
      <description>Лизинг выданный</description>
    </items>
    <items>
      <name>ОбязательствоПоФинансовомуЛизингу</name>
      <description>Обязательство по финансовому лизингу</description>
    </items>
    <items>
      <name>ПроизводныйФинансовыйИнструмент</name>
      <description>Производный финансовый инструмент</description>
    </items>
    <items>
      <name>ЦеннаяБумагаПУ</name>
      <description>Ценная бумага (по справедливой стоимости через прибыль/убыток)</description>
    </items>
    <items>
      <name>ЦеннаяБумагаСД</name>
      <description>Ценная бумага (по справедливой стоимости через прочий совокупный доход)</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособУчета</name>
    <type>
      <types>EnumRef.СпособыУчетаФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивОбязательство</name>
    <type>
      <types>EnumRef.АктивОбязательствоОбъектовФинансовогоХарактера</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиРасчетаПроцентов</name>
    <type>
      <types>EnumRef.ВидыСтавокОбъектовФинансовогоХарактера</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименятьПоправкуПоСправедливойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнаниеПроцентовМСФО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереводВКраткосрочную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеклассДляОтчетности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лизинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокиЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводныйФИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособУчетаПереоценки</name>
    <type>
      <types>EnumRef.СпособыУчетаПереоценкиФИ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеСправедливойСтоимости</name>
    <type>
      <types>EnumRef.ВидыРаскрытияСправедливойСтоимостиФИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Задолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратПоГрафику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаДисконта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикиРасчетовСоответствуютНСБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьНачислений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляРасчетаПроцентов</name>
    <type>
      <types>CatalogRef.СпособыРасчетаДнейПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьЭффектДляПервыхПроцентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Enums/СпособыУчетаФинансовыхИнструментов/СпособыУчетаФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУчетаФинансовыхИнструментов</name>
  <enumValues>
    <name>ПоАмортизированнойСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ПоСправедливойСтоимости</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыСтавокОбъектовФинансовогоХарактера/ВидыСтавокОбъектовФинансовогоХарактера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтавокОбъектовФинансовогоХарактера</name>
  <enumValues>
    <name>ЭффективнаяСтавка</name>
  </enumValues>
  <enumValues>
    <name>СтавкаПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>РыночнаяСтавка</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ВидыОбъектовФинансовогоХарактера/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.СпособУчета = ПредопределенноеЗначение("Перечисление.СпособыУчетаФинансовыхИнструментов.ПоАмортизированнойСтоимости") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ТипПогашенияОсновногоДолга");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ВидСтавкиРасчетаПроцентов = ПредопределенноеЗначение("Перечисление.ВидыСтавокОбъектовФинансовогоХарактера.ЭффективнаяСтавка") Тогда
		ЭтотОбъект.ПрименятьПоправкуПоСправедливойСтоимости = Ложь;
		ЭтотОбъект.ПорядокУчетаДисконта = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
